app/controllers/recipes_controller.rb

  def index
    @q = Recipe.ransack(params[:q])
    @recipes = @q.result.includes(:ingredients)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" IN (136775786, 216898435, 266175090, 323119470)
SELECT "recipes".* FROM "recipes"